package reo7sp.boardpp.util

/**
 * Created by reo7sp on 1/1/14 at 8:40 PM
 */
object SpecChars {
  val arrows = "➟➡➢➣➤➥➦➧➨➚➘➙➛➜➝➞➸♐➲➳⏎➴➵➶➷➸➹➺➻➼➽←↑→↓↔↕↖↗↘↙↚↛↜↝↞↟↠↡↢↣↤↥↦↧↨➫➬➩➪➭➮➯➱↩↪↫↬↭↮↯↰↱↲↳↴↵↶↷↸↹↺↻↼↽↾↿⇀⇁⇂⇃⇄⇅⇆⇇⇈⇉⇊⇋⇌⇍⇎⇏⇐⇑⇒⇓⇔⇕⇖⇗⇘⇙⇚⇛⇜⇝⇞⇟⇠⇡⇢⇣⇤⇥⇦⇧⇨⇩⇪⌦⌧⌫⇫⇬⇭⇮⇯⇰⇱⇲⇳⇴⇵⇶⇷⇸⇹⇺".split("|")
  val triangles = "▲▼◄►▶◀◣◢◥◤◥▸◂▴▾△▽▷◁⊿▻◅▵▿▹◃".split("|")
  val ratios = "⅟½⅓⅕⅙⅛⅔⅖⅚⅜¾⅗⅝⅞⅘".split("|")
  val circles = "➀➁➂➃➄➅➆➇➈➉➊➋➌➍➎➏➐➑➒➓ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ◉○◌◍◎●◐◑◒◓◔◕◖◗❂☢⊗⊙◘◙◍".split("|")
  val math = "%℅‰‱≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩⊰⊱⋛⋚".split("|")
  val money = "€£Ұ₴$₰¢₤¥₳₲₪₵元₣₱฿¤₡₮₭₩ރ円₢₥₫₦zł﷼₠₧₯₨Kčर".split("|")
  val weather = "☼☀☁☂☔☄☾☽❄☃☈⊙☉℃℉°❅✺ϟ☇".split("|")
  val yesNo = "☑✓✔√☐☒✇✖✗✘✕☓".split("|")
  val icons = "♔♕♖♗♘♙♚♛♜♝♞♟♤♧♡♢♠♣♥♦✽✾✿❁❃❋❀⚘☜☞☝☚☛☟✍✌✐✎✏✑✒✍✉⌨✆✉☎☏✁✂✃✄⚔".split("|")
  val letters = "ℂℍℕℙℚℝℤℬℰℯℱℊℋℎℐℒℓℳℴ℘ℛℭ℮ℌℑℜℨ™℠℗©®".split("|")
  val stars = "⋆✢✣✤✥❋✦✧✩✰✪✫✬✭✮✯❂✡★✱✲✳✴✵✶✷✸✹✺✻✼❄❅❆❇❈❉❊".split("|")
  val music = "♪♫♩♬♭♮♯°ø".split("|")
  val zodiac = "♈♉♊♋♌♍♎♏♐♑♒♓".split("|")
  val smiley = "☹☺☻تヅツッシÜϡﭢ".split("|")
}
